[
    {
        "cardid": "KYFxBsWC3kO+db04/LrX5A==",
        "sequence": 1,
        "ruling": "- You place a Spell Counter on this card when the Spell Card resolves, so if [[Magic Jammer]] is used to negate the Spell Card's activation then you do not place a Spell Counter on this monster. But if [[Imperial Order]] is chained to the Spell Card, you still place a Spell Counter on this monster because the activation of the Spell Card was not negated. If the Spell Card was a Continuous, Equip, or Field Spell Card, and [[Dust Tornado]] is chained to its activation and destroys it before it resolves you still place a Spell Counter because the activation of the card was not negated."
    },
    {
        "cardid": "KYFxBsWC3kO+db04/LrX5A==",
        "sequence": 2,
        "ruling": "- If you activate a Spell Card, and your opponent chains [[Call of the Haunted]] to Special Summon [[Skilled White Magician]], [[Skilled White Magician]] does not get a Spell Counter for that Spell Card because [[Skilled White Magician]] must be face-up on the field when the Spell Card is activated and when it resolves in order to get a Spell Counter."
    },
    {
        "cardid": "KYFxBsWC3kO+db04/LrX5A==",
        "sequence": 3,
        "ruling": "- You place a Spell Counter for any Spell Card that is activated, including Equip Spell, Field Spell, etc."
    },
    {
        "cardid": "KYFxBsWC3kO+db04/LrX5A==",
        "sequence": 4,
        "ruling": "- When you use the effect of a Continuous Spell Card that is already face-up on the field, such as [[Inspection]], or sending [[Wave-Motion Cannon]] to the Graveyard, or paying for [[Messenger of Peace]], you do NOT place a Spell Counter on this monster."
    },
    {
        "cardid": "KYFxBsWC3kO+db04/LrX5A==",
        "sequence": 5,
        "ruling": "- When [[Double Spell]] is played, you get a Spell Counter on this monster for the activation of [[Double Spell]], but not for the target of [[Double Spell]] because the target is never activated; so you get 1 Spell Counter on this monster."
    },
    {
        "cardid": "KYFxBsWC3kO+db04/LrX5A==",
        "sequence": 6,
        "ruling": "- You do not place a Spell Counter on this monster when you attach or detach a Union Monster because that is not the activation of a Spell Card."
    },
    {
        "cardid": "KYFxBsWC3kO+db04/LrX5A==",
        "sequence": 7,
        "ruling": "- If you activate [[Monster Reborn]] or [[Premature Burial]] to revive this monster, this monster does not get a Spell Counter for [[Monster Reborn]] (it has to be face-up on the field before the activation of the Spell Card)."
    },
    {
        "cardid": "KYFxBsWC3kO+db04/LrX5A==",
        "sequence": 8,
        "ruling": "- You can only Tribute this monster for its effect during Main Phase 1 or 2 of your turn."
    },
    {
        "cardid": "KYFxBsWC3kO+db04/LrX5A==",
        "sequence": 9,
        "ruling": "- This monster's effect does NOT target and you select the monster when you resolve the effect, so if you Tribute it to Special Summon [[Buster Blader]] from your Graveyard and your opponent chains [[Disappear]] and removes that [[Buster Blader]], you can Special Summon a different [[Buster Blader]] from your hand/Deck/Graveyard instead."
    },
    {
        "cardid": "KYFxBsWC3kO+db04/LrX5A==",
        "sequence": 10,
        "ruling": "- If there are no [[Buster Blader]] in your hand, Deck, and Graveyard, you cannot activate [[Skilled White Magician]]'s effect that Special Summons [[Buster Blader]]."
    },
    {
        "cardid": "KYFxBsWC3kO+db04/LrX5A==",
        "sequence": 11,
        "ruling": "- When [[Skill Drain]] is active, and you or your opponent activates a Spell Card, do not place Spell Counters on this monster. Any Spell Counters that are on this monster are removed when [[Skill Drain]] is activated."
    },
    {
        "cardid": "KYFxBsWC3kO+db04/LrX5A==",
        "sequence": 12,
        "ruling": "- If a player controls the opponent's [[Skilled White Magician]] and Tribute it with 3 Spell Counters, the player who controlled and Tributed the [[Skilled White Magician]] is the player who Special Summons [[Buster Blader]] from the hand, Deck, or Graveyard."
    }
]