[
    {
        "cardid": "+yUUCx8+rE6pzr0+PFEPyg==",
        "sequence": 1,
        "ruling": "- Your opponent can still Flip Summon a monster."
    },
    {
        "cardid": "+yUUCx8+rE6pzr0+PFEPyg==",
        "sequence": 2,
        "ruling": "- If there are already more monsters on your opponent's side of the field when you activate [[Kaiser Colosseum]], nothing happens to your opponent's monsters but your opponent cannot Summon any more. Also, if the number of monsters controlled by [[Kaiser Colosseum]]'s controller is reduced, the opponent does not have to remove any of his monsters."
    },
    {
        "cardid": "+yUUCx8+rE6pzr0+PFEPyg==",
        "sequence": 3,
        "ruling": "- Your opponent cannot use [[Monster Reborn]], [[Scapegoat]], etc. while [[Kaiser Colosseum]] prevents him from placing new monsters. However, your opponent CAN use [[Change of Heart]], [[Snatch Steal]], etc."
    },
    {
        "cardid": "+yUUCx8+rE6pzr0+PFEPyg==",
        "sequence": 4,
        "ruling": "- If all monsters of [[Kaiser Colosseum]]'s controller are destroyed, [[Kaiser Colosseum]]'s effect no longer functions until that player has at least 1 monster again (when the effect re-activates)."
    },
    {
        "cardid": "+yUUCx8+rE6pzr0+PFEPyg==",
        "sequence": 5,
        "ruling": "- If the player who controls [[Kaiser Colosseum]] has his only monster taken by the opponent with [[Change of Heart]], then the opponent can place more monsters because [[Kaiser Colosseum]]'s effect is no longer active until the player has at least 1 monster again."
    },
    {
        "cardid": "+yUUCx8+rE6pzr0+PFEPyg==",
        "sequence": 6,
        "ruling": "- When [[Kaiser Colosseum]] is active, and [[Cyber Jar]] is activated, if your opponent would control more monsters than you, your opponent has to destroy monsters equal to the difference; the excess monsters are never actually Summoned and instead are sent from the Deck to the Graveyard (so [[Witch of the Black Forest]] does not get its effect, etc.). So the monsters are destroyed after they are picked up, but before any monsters are Special Summoned for the effect of [[Cyber Jar]]."
    },
    {
        "cardid": "+yUUCx8+rE6pzr0+PFEPyg==",
        "sequence": 7,
        "ruling": "- While you have [[Kaiser Colosseum]] on the field, your opponent can Tribute Summon, if after the Summon they will control less or an equal number of monsters as you do."
    }
]