[
    {
        "cardid": "WrrlENIL5kak9GX2KySfAA==",
        "sequence": 1,
        "ruling": "- If you use this card on a Trap Card that was just Set this turn, the timing is incorrect so the Trap is destroyed. If you use this card and activate a Trap Card with a cost, and that Trap Card's activation timing is correct, its owner must pay all possible costs. If they cannot pay the costs, the Trap Card is negated and destroyed."
    },
    {
        "cardid": "WrrlENIL5kak9GX2KySfAA==",
        "sequence": 2,
        "ruling": "- If [[Bait Doll]] is activated and targets an [[Imperial Order]] the opponent may chain the [[Imperial Order]] which will negate the effect of [[Bait Doll]] and it will not be returned to your Deck. Or the opponent can allow [[Bait Doll]] to force the activation of [[Imperial Order]], and [[Bait Doll]] will be shuffled into the Deck and [[Imperial Order]] will remain active on the field because the timing of its activation was legitimate."
    },
    {
        "cardid": "WrrlENIL5kak9GX2KySfAA==",
        "sequence": 3,
        "ruling": "- If [[Bait Doll]] is activated and targets [[Magic Jammer]], [[Magic Drain]], etc. the opponent may chain the Trap Card to negate and destroy [[Bait Doll]]. If they do not, the Trap Card will be destroyed since the activation timing is incorrect, and [[Bait Doll]] will be shuffled into your Deck."
    },
    {
        "cardid": "WrrlENIL5kak9GX2KySfAA==",
        "sequence": 4,
        "ruling": "- You cannot chain to a Trap Card that was forced to activate by the effect of [[Bait Doll]] since an existing Chain is in the middle of resolving."
    },
    {
        "cardid": "WrrlENIL5kak9GX2KySfAA==",
        "sequence": 5,
        "ruling": "- If [[Jinzo]] is face-up on the field and the effect of [[Bait Doll]] forces the activation of a Normal or Counter Trap Card, that Trap Card's effect is negated and the Trap Card is destroyed. If a Continuous Trap Card is forced to activate by the effect of [[Bait Doll]] it will remain face-up on the field meaninglessly until [[Jinzo]] is destroyed."
    },
    {
        "cardid": "WrrlENIL5kak9GX2KySfAA==",
        "sequence": 6,
        "ruling": "- If the target of [[Bait Doll]] is no longer on the field (if it was sent to the Graveyard with [[Emergency Provisions]], or destroyed by [[Mystical Space Typhoon]], as a chain to the activation of [[Bait Doll]]), then [[Bait Doll]] is still shuffled back into the Deck. As long as the activation and effect of [[Bait Doll]] are not negated, the effect of [[Bait Doll]] that shuffles it back into the Deck still resolves."
    },
    {
        "cardid": "WrrlENIL5kak9GX2KySfAA==",
        "sequence": 7,
        "ruling": "- If [[Chain Burst]] is active on the field and you use [[Bait Doll]] to activate the opponent's Trap Card, and its timing is correct, the opponent takes the 1000 points of damage."
    },
    {
        "cardid": "WrrlENIL5kak9GX2KySfAA==",
        "sequence": 8,
        "ruling": "- When [[Bait Doll]] is activated, [[Fake Trap]] cannot be activated because there is no guarantee that [[Bait Doll]] will destroy a Trap Card."
    }
]