[
    {
        "cardid": "BQGWI7+F9EOjTcYyOTMH1A==",
        "sequence": 1,
        "ruling": "- You only remove the 3 Fiend-Type monsters in your Graveyard from play when you Special Summon [[Dark Necrofear]] from your hand. If you successfully Special Summon it using this method, and then wish to use [[Monster Reborn]] to Special Summon it from the Graveyard, you do not have to remove 3 more Fiend-Type monsters from the Graveyard."
    },
    {
        "cardid": "BQGWI7+F9EOjTcYyOTMH1A==",
        "sequence": 2,
        "ruling": "- If [[Banisher of the Light]] is on the field when [[Dark Necrofear]] is destroyed, [[Dark Necrofear]] is removed from play and does not return as an Equip Spell Card."
    },
    {
        "cardid": "BQGWI7+F9EOjTcYyOTMH1A==",
        "sequence": 3,
        "ruling": "- If [[Imperial Order]] is active when [[Dark Necrofear]] is destroyed while a Monster Card, it must still be equipped to your opponent's monster, but you will not gain control of it because its effect is negated by [[Imperial Order]]."
    },
    {
        "cardid": "BQGWI7+F9EOjTcYyOTMH1A==",
        "sequence": 4,
        "ruling": "- If all 5 of your Spell / Trap Card Zones are full during your End Phase of the turn [[Dark Necrofear]] was destroyed while a Monster Card, you cannot activate its effect, and the effect disappears."
    },
    {
        "cardid": "BQGWI7+F9EOjTcYyOTMH1A==",
        "sequence": 5,
        "ruling": "- If [[Dark Necrofear]] is destroyed, you can Special Summon it from your Graveyard with [[Monster Reborn]], [[Premature Burial]], etc. before your End Phase, and its effect will be reset."
    },
    {
        "cardid": "BQGWI7+F9EOjTcYyOTMH1A==",
        "sequence": 6,
        "ruling": "- If this card was discarded from your hand by an opponent's card effect, such as [[Confiscation]], it does not become an Equip Spell Card during the End Phase, since it was not destroyed."
    },
    {
        "cardid": "BQGWI7+F9EOjTcYyOTMH1A==",
        "sequence": 7,
        "ruling": "- If the Special Summoning of [[Dark Necrofear]] is negated and [[Dark Necrofear]] is destroyed by the effect of [[Solemn Judgment]] or [[Horn of Heaven]], it will become an Equip Spell Card during the End Phase."
    },
    {
        "cardid": "BQGWI7+F9EOjTcYyOTMH1A==",
        "sequence": 8,
        "ruling": "- [[Tailor of the Fickle]] or [[Collected Power]] can be used to move [[Dark Necrofear]] from one monster to another after it is an Equip Spell Card. [[Fairy's Hand Mirror]] or [[Shift]] cannot be used when [[Dark Necrofear]] first becomes an Equip Spell Card and is equipped to your opponent's monster."
    },
    {
        "cardid": "BQGWI7+F9EOjTcYyOTMH1A==",
        "sequence": 9,
        "ruling": "- If it is destroyed by your opponent's [[Harpie's Feather Duster]], [[Dust Tornado]], etc. while it is an Equip Spell Card, [[Dark Necrofear]] will not return during the End Phase since it was not destroyed while a Monster Card."
    },
    {
        "cardid": "BQGWI7+F9EOjTcYyOTMH1A==",
        "sequence": 10,
        "ruling": "- If your [[Dark Necrofear]] is destroyed on your opponent's side of the field, by either player's card effect, it will not activate during the End Phase. It must be on your side of the field and sent to your Graveyard when it is destroyed for its effect to activate."
    }
]