[
    {
        "cardid": "cgmLLybgwE+qWcQ7HGT6DA==",
        "sequence": 1,
        "ruling": "- [[Gorgon's Eye]] cannot negate the effect of [[Sangan]], [[Witch of the Black Forest]], or [[Sinister Serpent]] because they activate in the Graveyard. If a Defense Position [[Slate Warrior]] is attacked and destroyed, the effect of [[Slate Warrior]] that lowers ATK and DEF is applied because it activates in the Graveyard."
    },
    {
        "cardid": "cgmLLybgwE+qWcQ7HGT6DA==",
        "sequence": 2,
        "ruling": "- [[Gorgon's Eye]]'s effect will include monsters in Defense Position that are Summoned after [[Gorgon's Eye]] resolves."
    },
    {
        "cardid": "cgmLLybgwE+qWcQ7HGT6DA==",
        "sequence": 3,
        "ruling": "- If a monster in Defense Position is changed to Attack Position, [[Gorgon's Eye]] no longer affects the monster and the monster's effect will be applied."
    },
    {
        "cardid": "cgmLLybgwE+qWcQ7HGT6DA==",
        "sequence": 4,
        "ruling": "- If [[Gorgon's Eye]] is active and you activate a monster effect, and [[Book of Moon]] is chained to flip the monster into Defense Position, the monster's effect is still applied and is not negated by Gorgon's Eye because it was activated properly."
    },
    {
        "cardid": "cgmLLybgwE+qWcQ7HGT6DA==",
        "sequence": 5,
        "ruling": "- A Defense Position Flip Effect Monster that is attacked will have its Flip Effect negated by [[Gorgon's Eye]] because it remains in Defense Position. A Defense Position Flip Effect Monster that is Flip Summoned will not have its Flip Effect negated because it is now in Attack Position."
    },
    {
        "cardid": "cgmLLybgwE+qWcQ7HGT6DA==",
        "sequence": 6,
        "ruling": "- If a Defense Position monster has Spell Counters, like [[Skilled White Magician]] or [[Royal Magical Library]], the Spell Counters are removed if [[Gorgon's Eye]] is activated."
    },
    {
        "cardid": "cgmLLybgwE+qWcQ7HGT6DA==",
        "sequence": 7,
        "ruling": "- Monsters like [[D.D. Warrior Lady]] attacked while in Defense Position have their effects negated (because they are used before the monster is sent to the Graveyard)."
    },
    {
        "cardid": "cgmLLybgwE+qWcQ7HGT6DA==",
        "sequence": 8,
        "ruling": "- While [[Gorgon's Eye]] is active, if [[Relinquished]] equipped with a  monster is in Defense Position, the effect of [[Relinquished]] is negated, it can no longer be equipped with a monster, and the Monster Card equipped to [[Relinquished]] is destroyed and sent to the Graveyard."
    }
]