[
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 1,
        "ruling": "- If, after drawing during your opponent's Standby Phase, your [[Mirage of Nightmare]] is destroyed before you have to discard, then you do not need to discard for its effect."
    },
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 2,
        "ruling": "- You may activate [[Mystical Space Typhoon]] during your Draw Phase to destroy [[Mirage of Nightmare]] before you have to discard during your Standby Phase. If your Draw Phase was skipped for some reason, you can still activate [[Mystical Space Typhoon]] to destroy [[Mirage of Nightmare]] before activating the effect of [[Mirage of Nightmare]] that will force you to discard. (You can activate any number of effects during your own Standby Phase in any order you wish, as long as required effects are dealt with by the time you leave the Standby Phase and enter your Main Phase 1.)"
    },
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 3,
        "ruling": "- When the turn player controls [[Mirage of Nightmare]] and [[Imperial Order]]:"
    },
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 4,
        "ruling": "- If you draw for [[Mirage of Nightmare]] during your opponent's Standby Phase, and then activate [[Imperial Order]] after that, during your Standby Phase you will have 2 mandatory effects: discarding for [[Mirage of Nightmare]] and paying 700 Life Points for [[Imperial Order]] or else destroying it. In this case, you choose which effect to resolve first, and you can choose to resolve [[Mirage of Nightmare]] first, even though its effect will be negated by [[Imperial Order]]. So you activate its effect, and do not discard. Then you can choose not to pay 700 Life Points to keep [[Imperial Order]], and [[Imperial Order]] will be destroyed. Then you can enter Main Phase 1, and you did not have to discard for [[Mirage of Nightmare]] (because its effect was negated at the time you chose to resolve it)."
    },
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 5,
        "ruling": "- When the turn player controls [[Imperial Order]] and the opponent controls [[Mirage of Nightmare]]:"
    },
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 6,
        "ruling": "- If the opponent controls [[Mirage of Nightmare]] going into the turn player's Standby Phase, and the turn player already controls a face-up [[Imperial Order]], then there are 2 mandatory effects that must be resolved: the turn player must pay 700 Life Points or destroy [[Imperial Order]], and the opponent must draw cards for [[Mirage of Nightmare]]. The turn player has priority to resolve an effect first. If the turn player passes, priority goes to the opponent. If the opponent also passes, then the turn player must resolve an effect, and must pay for [[Imperial Order]] or it is destroyed. If he does not pay, and [[Imperial Order]] is destroyed, then the opponent can draw for [[Mirage of Nightmare]]."
    },
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 7,
        "ruling": "- The same procedure is used if both players control [[Mirage of Nightmare]]. Generally, the turn player will first discard for [[Mirage of Nightmare]], then the opponent will draw for their [[Mirage of Nightmare]]."
    },
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 8,
        "ruling": "- If you discard [[Sinister Serpent]] during your Standby Phase for the effect of [[Mirage of Nightmare]], you may add [[Sinister Serpent]] back to your hand during that same Standby Phase."
    },
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 9,
        "ruling": "- If you have multiple copies of [[Mirage of Nightmare]], you don't draw for more than 1 because you have 4 cards in your hand from using the effect of only 1 of them; nor do you have to discard for the second copy because you didn't draw any cards using its effect. If you draw so that you have 4 cards using 1 [[Mirage of Nightmare]], and some effect causes you to discard during that same Standby Phase, you may then activate the other [[Mirage of Nightmare]] to draw back up to 4; in this case you discard separately for each [[Mirage of Nightmare]] because you drew with both, and if 1 of them is destroyed you do not have to discard for its effect, only for the effect of the [[Mirage of Nightmare]] that was not destroyed."
    },
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 10,
        "ruling": "- If you have 4 or more cards in your hand during your opponent's Standby Phase, do not draw, and do not discard during your next Standby Phase (the effect of [[Mirage of Nightmare]] is not applied)."
    },
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 11,
        "ruling": "- If your Standby Phase is skipped because of [[Solomon's Lawbook]], etc., do not discard for [[Mirage of Nightmare]]."
    },
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 12,
        "ruling": "- Drawing for [[Mirage of Nightmare]] is considered 1 draw no matter how many cards are drawn, so you only gain 500 Life Points if you have [[Solemn Wishes]]."
    },
    {
        "cardid": "I+ykNwu2P0GZU6DowXWFyQ==",
        "sequence": 13,
        "ruling": "- If you draw 3 cards for [[Mirage of Nightmare]], but only have 2 cards in your hand during your next Standby Phase, discard your entire hand (2 cards)."
    }
]