[
    {
        "cardid": "mLh1P4Jfe0CdfT3UjaGaPQ==",
        "sequence": 1,
        "ruling": "- You cannot Summon [[Phantom Dragon]] if you do not have 2 Monster Card Zones that you can make unusable. However, [[Phantom Dragon]] can be Set or Special Summoned face-down when you do not have 2 Monster Card Zones to make unusable."
    },
    {
        "cardid": "mLh1P4Jfe0CdfT3UjaGaPQ==",
        "sequence": 2,
        "ruling": "- You cannot activate [[Phantom Dragon]]'s effect during the Damage Step."
    },
    {
        "cardid": "mLh1P4Jfe0CdfT3UjaGaPQ==",
        "sequence": 3,
        "ruling": "- If a face-down [[Phantom Dragon]] is flipped face-up, you will select 2 Monster Card Zones to make unusable. If none can be selected, the next 2 Monster Card Zones to become available will be made unusable."
    },
    {
        "cardid": "mLh1P4Jfe0CdfT3UjaGaPQ==",
        "sequence": 4,
        "ruling": "- [[Phantom Dragon]] can be Tribute Summoned if the Tributed monsters will create 2 Monster Card Zones that can be made unusable."
    },
    {
        "cardid": "mLh1P4Jfe0CdfT3UjaGaPQ==",
        "sequence": 5,
        "ruling": "- 2 [[Phantom Dragon]]s cannot select the same Monster Card Zones to make unusable."
    },
    {
        "cardid": "mLh1P4Jfe0CdfT3UjaGaPQ==",
        "sequence": 6,
        "ruling": "- Once a Monster Card Zone is chosen, you cannot change your choice to a different Monster Card Zone later in the Duel."
    },
    {
        "cardid": "mLh1P4Jfe0CdfT3UjaGaPQ==",
        "sequence": 7,
        "ruling": "- If you have 1 face-up [[Phantom Dragon]] while [[Skill Drain]] is active, when your opponent Special Summons a monster you can Special Summon another [[Phantom Dragon]] into one of the Monster Card Zones that was made unusable by the negated [[Phantom Dragon]]."
    },
    {
        "cardid": "mLh1P4Jfe0CdfT3UjaGaPQ==",
        "sequence": 8,
        "ruling": "- If you take control of your opponent's [[Phantom Dragon]], you will select 2 Monster Card Zones on your side of the field to make unusable. If you do not have any available, the next 2 Monster Card Zones to become available will be made unusable."
    }
]