[
    {
        "cardid": "9Ve/P/peR0qx3qX1T86IDQ==",
        "sequence": 1,
        "ruling": "- The ATK bonus for [[Power Bond]] lasts as long as the Fusion Monster is face-up on the field. If it is flipped face-down or removed from the field, the ATK increase disappears."
    },
    {
        "cardid": "9Ve/P/peR0qx3qX1T86IDQ==",
        "sequence": 2,
        "ruling": "- The ATK bonus for [[Power Bond]] is not a fixed number. It is a bonus equal to the original ATK. So if the original ATK changes, so does the bonus from [[Power Bond]]."
    },
    {
        "cardid": "9Ve/P/peR0qx3qX1T86IDQ==",
        "sequence": 3,
        "ruling": "- You cannot use [[Barrel Behind the Door]] against the damage from [[Power Bond]] because the damage happens much later than the activation of the [[Power Bond]] card."
    },
    {
        "cardid": "9Ve/P/peR0qx3qX1T86IDQ==",
        "sequence": 4,
        "ruling": "- Even if the Fusion Monster is removed from the field or flipped face-down, you cannot negate the effect of [[Power Bond]] and the player will still take damage equal to the original ATK."
    },
    {
        "cardid": "9Ve/P/peR0qx3qX1T86IDQ==",
        "sequence": 5,
        "ruling": "- The damage you take because of [[Power Bond]] is equal to the original ATK of the Fusion Monster at the time the monster is Special Summoned. If the Fusion Monster has its original ATK changed, this does not affect the damage inflicted by [[Power Bond]]."
    },
    {
        "cardid": "9Ve/P/peR0qx3qX1T86IDQ==",
        "sequence": 6,
        "ruling": "- If you Fusion Summon [[UFOroid Fighter]] with 3000 ATK, and then later in the turn [[Skill Drain]] is activated, reducing its ATK to 0, you will still take 3000 points of damage during the End Phase. If you send [[UFOroid Fighter]] to the Graveyard so that its effect resets and its original ATK becomes zero, you still take damage equal to its original ATK at the time it was Special Summoned by [[Power Bond]]."
    },
    {
        "cardid": "9Ve/P/peR0qx3qX1T86IDQ==",
        "sequence": 7,
        "ruling": "- You can prevent the damage from [[Power Bond]] with [[Des Wombat]]."
    },
    {
        "cardid": "9Ve/P/peR0qx3qX1T86IDQ==",
        "sequence": 8,
        "ruling": "- If [[Non-Spellcasting Area]] is active and [[Power Bond]] is used to Special Summon a Fusion Monster that has no effect, the Fusion Monster will not gain the ATK bonus from [[Power Bond]], but the controller will still take damage for [[Power Bond]] (because the player is not a non-Effect Monster Card)."
    },
    {
        "cardid": "9Ve/P/peR0qx3qX1T86IDQ==",
        "sequence": 9,
        "ruling": "- If you equip the monster Special Summoned by [[Power Bond]] with [[Megamorph]], the ATK gained from [[Power Bond]] disappears but the damage is still inflicted in the End Phase."
    }
]