[
    {
        "cardid": "GseeQDgijEufXRp/NL7p+w==",
        "sequence": 1,
        "ruling": "- If [[Horus the Black Flame Dragon LV4]] destroys a monster, you can activate its effect during the End Phase, even if the destroyed monster was your monster that was controlled by your opponent."
    },
    {
        "cardid": "GseeQDgijEufXRp/NL7p+w==",
        "sequence": 2,
        "ruling": "- If you don't have [[Horus the Black Flame Dragon LV6]] in your hand or Deck, you cannot send [[Horus the Black Flame Dragon LV4]] to the Graveyard to activate its effect."
    },
    {
        "cardid": "GseeQDgijEufXRp/NL7p+w==",
        "sequence": 3,
        "ruling": "- If [[Horus the Black Flame Dragon LV4]] destroys a monster as a result of battle, and is removed from play by [[Interdimensional Matter Transporter]], and returns to play during the End Phase, you can still activate its effect."
    },
    {
        "cardid": "GseeQDgijEufXRp/NL7p+w==",
        "sequence": 4,
        "ruling": "- If [[Banisher of the Light]] is in play, you cannot send [[Horus the Black Flame Dragon LV4]] to the Graveyard, so you cannot activate its effect."
    },
    {
        "cardid": "GseeQDgijEufXRp/NL7p+w==",
        "sequence": 5,
        "ruling": "- You don't have to send [[Horus the Black Flame Dragon LV4]] to the Graveyard if you don't want to, even if it destroyed a monster as a result of battle. But if you activate its effect by sending it to the Graveyard, you must Special Summon [[Horus the Black Flame Dragon LV6]] if possible."
    },
    {
        "cardid": "GseeQDgijEufXRp/NL7p+w==",
        "sequence": 6,
        "ruling": "- You can activate the effect of [[Horus the Black Flame Dragon LV4]] during your opponent's End Phase if appropriate."
    },
    {
        "cardid": "GseeQDgijEufXRp/NL7p+w==",
        "sequence": 7,
        "ruling": "- If a level monster fulfills its condition to Special Summon the next-highest level (for example, if [[Armed Dragon LV5]] destroys a monster as a result of battle), and the level monster is then flipped face-down, or removed from play permanently, or sent to the Graveyard and then Special Summoned from the Graveyard, then its condition is reset and it is no longer considered to have met the condition to level up to the next level."
    }
]