[
    {
        "cardid": "EmMeR6PWqkmJ6qm+So2Qcw==",
        "sequence": 1,
        "ruling": "- You can put 2 or more counters on a Spell Card if you activate 2 or more [[Magic Reflector]]s. When the Spell Card is destroyed, remove the counters on it 1-by-1."
    },
    {
        "cardid": "EmMeR6PWqkmJ6qm+So2Qcw==",
        "sequence": 2,
        "ruling": "- You can activate [[Magic Reflector]] and put a counter on a Monster Card equipped to [[Relinquished]], and if the equipped card would be destroyed, remove 1 counter instead."
    },
    {
        "cardid": "EmMeR6PWqkmJ6qm+So2Qcw==",
        "sequence": 3,
        "ruling": "- If [[Imperial Order]] is active, and if a Spell Card with a counter on it would be destroyed, the counter is removed instead. [[Imperial Order]] does not negate the function of counters created by the effect of [[Magic Reflector]]."
    },
    {
        "cardid": "EmMeR6PWqkmJ6qm+So2Qcw==",
        "sequence": 4,
        "ruling": "- If a Spell Card with a maintenance cost has a counter on it, such as [[Messenger of Peace]], and you choose not to pay the cost, the Spell Card is still destroyed."
    },
    {
        "cardid": "EmMeR6PWqkmJ6qm+So2Qcw==",
        "sequence": 5,
        "ruling": "- If a Field Spell Card has a counter on it and a player activates a new Field Spell Card, the Field Spell Card with the counter is still destroyed."
    },
    {
        "cardid": "EmMeR6PWqkmJ6qm+So2Qcw==",
        "sequence": 6,
        "ruling": "- If [[Swords of Revealing Light]] has a counter on it, it is still destroyed at the end of the opponent's third turn after it was activated."
    },
    {
        "cardid": "EmMeR6PWqkmJ6qm+So2Qcw==",
        "sequence": 7,
        "ruling": "- If you use [[Magic Reflector]] to place a counter on a Union Monster that is an Equip Card, and the Union Monster would be destroyed instead of the equipped monster, remove the [[Magic Reflector]] counter from the Union Monster instead, and the Union Monster is not destroyed."
    }
]