[
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 1,
        "ruling": "- [[Last Turn]] is a very special Trap Card with very special and unusual rules. The most important thing to understand about [[Last Turn]] is that not all of its effects are applied when the Trap Card resolves. When [[Last Turn]] (the Trap Card itself) resolves, the activating player selects 1 monster on their side of the field, and all other cards on the field and in both players' hands are sent to the Graveyard. That is all that happens when [[Last Turn]] resolves. After that, the turn player Special Summons 1 monster from their Deck. After that, a special Battle Phase occurs. Then, during the End Phase, the victory check of [[Last Turn]] is applied. [[Last Turn]] sets up several effects that resolve later in the turn long after the Trap Card itself has resolved. Several other cards do this too, like [[Last Will]] and [[Change of Heart]]."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 2,
        "ruling": "- Suppose that [[Ceasefire]] is activated (Chain Link 1), and [[Last Turn]] is chained to it (Chain Link 2). In this case, [[Last Turn]] resolves first, the activating player selects 1 monster on their side of the field, and all other cards are sent to the Graveyard. Then resolve the effect of [[Ceasefire]] (Chain Link 1). After [[Ceasefire]] resolves, the turn player Special Summons a monster for [[Last Turn]], then the special Battle Phase occurs, then in the End Phase the victory check is applied. This is an example of how the special nature of [[Last Turn]] works: the only thing that happens when [[Last Turn]] resolves is to select 1 monster and send all other cards to the Graveyard."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 3,
        "ruling": "- [[Last Turn]] is not a card that Special Summons a monster when it resolves. Therefore you can activate [[Last Turn]] even while [[Jowgen the Spiritualist]] is face-up on the field. If the player activating [[Last Turn]] controls [[Jowgen the Spiritualist]] and selects it as the monster to keep, the opponent cannot Special Summon for [[Last Turn]], and there will be no special Battle Phase. However the victory check is still applied in the End Phase."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 4,
        "ruling": "- The special Battle Phase for [[Last Turn]] happens right after the monster is Special Summoned. It is in addition to the normal Battle Phase and does not disrupt the normal order of the turn. For example, if [[Last Turn]] is activated during the Draw Phase, resolves the effect, Special Summon, initiate the special Battle Phase, then continue with the Draw Phase. The turn player can have a normal Battle Phase later in the turn."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 5,
        "ruling": "- The special Battle Phase is treated like a standard Battle Phase in every other way, with a Start Step, Battle Step, Damage Step, and End Step. Only the selected monster and the Special Summoned monster can battle."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 6,
        "ruling": "- If you activate [[Last Turn]] and select your [[The Rock Spirit]] or [[Soul of Purity and Light]] their effects will be applied during your opponent's special Battle Phase. Also any Flip Effects are resolved as normal, etc. You can use the effect of [[Injection Fairy Lily]] and other monster effects during the special Battle Phase."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 7,
        "ruling": "- The effect that reduces Battle Damage to zero applies only for the special Battle Phase, not for the normal Battle Phase. Example: A player activates [[Last Turn]] and selects their Defense Position [[Spirit Reaper]]. The turn player Special Summons [[Enraged Battle Ox]] and attacks in the special Battle Phase, but no damage occurs. However, during the turn player's normal Battle Phase they can attack again, and will inflict 1500 points of damage due to the effect of [[Enraged Battle Ox]], so the opponent's Life Points will be zero and the turn player will win."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 8,
        "ruling": "- If the Battle Phase is skipped because of [[Thunder of Ruler]] or [[Soul Exchange]], resolve the effects of [[Last Turn]] as much as possible (including victory check, quite possibly resulting in a DRAW)."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 9,
        "ruling": "- You can chain to the activation of [[Last Turn]] with cards like [[Ring of Destruction]], [[Offerings to the Doomed]], or [[Compulsory Evacuation Device]] to eliminate the opponent's monsters. If the player who activated [[Last Turn]] has no monsters on the field when it resolves, the effects of [[Last Turn]] are not negated. So the turn player still Special Summons a monster, although the special Battle Phase is not conducted, but the victory check in the End Phase is still performed."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 10,
        "ruling": "- The victory check for [[Last Turn]] is an effect that must be resolved by the player who activated it. The turn player still has priority to activate and resolve any other effects first. You cannot chain to the victory check of [[Last Turn]]."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 11,
        "ruling": "- If your opponent activates [[Last Turn]] and you Special Summon [[Dark Magician of Chaos]] from your Deck, you can activate his effect to add a Spell Card from your Graveyard to your hand."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 12,
        "ruling": "- After [[Last Turn]] sends all cards to the Graveyard, before the Special Summon for [[Last Turn]] is performed, monster effects like [[Despair from the Dark]], [[Elephant Statue of Disaster]], and [[Regenerating Mummy]] will activate."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 13,
        "ruling": "- If [[Night Assailant]] is sent from the hand to the Graveyard by the effect of [[Last Turn]], resolve the effect of [[Night Assailant]] before Special Summoning for [[Last Turn]]."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 14,
        "ruling": "- If your opponent activates [[Last Turn]] and you Special Summon a monster that can attack twice, it can attack twice during the special Battle Phase (important if the opponent had a monster like [[Big Core]])."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 15,
        "ruling": "- [[Last Turn]] as a chain to [[Change of Heart]]: Suppose the turn player activates [[Change of Heart]] and the opponent chains [[Last Turn]], then the opponent selects the monster targeted by [[Change of Heart]] for [[Last Turn]] (since it's still on his side of the field, as [[Change of Heart]] hasn't resolved yet). Then [[Change of Heart]] resolves and the turn player gains control of the monster, then Special Summons for [[Last Turn]]. There is no special Battle Phase. Assuming that the opponent somehow survives the standard Battle Phase, during the End Phase, the turn player has priority to activate and resolve an effect. If the turn player activates and resolves [[Change of Heart]], then the monster goes back to the opponent and (assuming nothing else has happened), both players each have 1 monster and the result is a DRAW. If the turn player passes priority to the opponent, the opponent can activate and resolve the effect of [[Last Turn]] before [[Change of Heart]], and in this case the turn player still has 2 monsters and the opponent has zero, so the turn player would win. If the turn player passed priority to the opponent and the opponent passes it back, the turn player MUST activate and resolve an effect, so the effect of [[Change of Heart]] would expire and both players would have 1 monster each, resulting in a DRAW."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 16,
        "ruling": "- You cannot Special Summon a monster for [[Last Turn]] that is a \"Special Summon-only\" monster like [[Chaos Emperor Dragon - Envoy of the End]], [[Dark Necrofear]], or [[Ocean Dragon Lord - Neo-Daedalus]]. Nor can you select a Spirit Monster because they cannot be Special Summoned."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 17,
        "ruling": "- You CAN Special Summon a high-level monster that has no Special Summoning restrictions for [[Last Turn]], such as [[Blue-Eyes White Dragon]] or [[Dark Magician of Chaos]]."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 18,
        "ruling": "- If you activate [[Last Turn]] and select your face-up [[Thousand-Eyes Restrict]], the turn player cannot attack so unless they can destroy your [[Thousand-Eyes Restrict]] with a card effect, each of you will have a monster during the End Phase and the Duel will end in a DRAW."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 19,
        "ruling": "- While your Life Points are 1000 or less, you can activate [[Last Turn]] in any part of your opponent's turn, except the Damage Step. You can even activate it during the End Phase."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 20,
        "ruling": "- If [[Last Turn]] is activated and the turn player has no monsters to Summon, there is no battle however the victory check is still applied."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 21,
        "ruling": "- If you activate [[Last Turn]] during the Draw Phase or Standby Phase, and select your face-up [[Jowgen the Spiritualist]], your opponent can still retrieve their [[Sinister Serpent]], Summon it normally in Main Phase 1, and attack and destroy [[Jowgen the Spiritualist]] in the normal Battle Phase, then win the Duel in the End Phase because of the victory check of [[Last Turn]]."
    },
    {
        "cardid": "Q2KASZola0eud+5NELaJ8w==",
        "sequence": 22,
        "ruling": "- If [[Jinzo]] is Special Su"
    }
]