[
    {
        "cardid": "kvKxTRP9Y06pdV/l6k9EHg==",
        "sequence": 1,
        "ruling": "- Missing the Timing: Suppose you have 3 copies of [[Heart of the Underdog]] on the field, and draw a Normal Monster Card during your Draw Phase. All 3 copies of [[Heart of the Underdog]] immediately activate their effects, and because they activate simultaneously, they form a chain with Chain Links 1, 2, and 3. If you draw a Normal Monster card for Chain Link 3 or Chain Link 2, your copies of [[Heart of the Underdog]] do not activate again. This is because they are \"when… you can\" optional Trigger Effects, and you \"miss the timing\" because you drew the Normal Monster Card during a chain and not as Chain Link 1. However, if you draw a Normal Monster Card for Chain Link 1, all 3 copies of [[Heart of the Underdog]] will activate their effects again."
    },
    {
        "cardid": "kvKxTRP9Y06pdV/l6k9EHg==",
        "sequence": 2,
        "ruling": "- [[Heart of the Underdog]] doesn't only activate if you draw a Normal Monster Card for your standard draw. It will also activate its effect if you draw a Normal Monster Card with a card effect such as [[Reload]], [[Jar of Greed]], or [[Heart of the Underdog]]."
    },
    {
        "cardid": "kvKxTRP9Y06pdV/l6k9EHg==",
        "sequence": 3,
        "ruling": "- When you draw a Normal Monster Card, if you want to activate the effect of [[Heart of the Underdog]] you have to show it to your opponent immediately. You can't do anything else in between."
    },
    {
        "cardid": "kvKxTRP9Y06pdV/l6k9EHg==",
        "sequence": 4,
        "ruling": "- A Normal Monster Card means a yellow card with no effect. A Ritual Monster with no effect is not a Normal Monster Card. A card like [[Blue-Eyes Toon Dragon]] is not a Normal Monster Card."
    },
    {
        "cardid": "kvKxTRP9Y06pdV/l6k9EHg==",
        "sequence": 5,
        "ruling": "- When you show a Normal Monster Card to your opponent to activate [[Heart of the Underdog]], your opponent can chain [[Drop Off]]. You will have to discard that Normal Monster Card, but [[Heart of the Underdog]] still resolves its effect."
    },
    {
        "cardid": "kvKxTRP9Y06pdV/l6k9EHg==",
        "sequence": 6,
        "ruling": "- If you draw multiple cards at the same time during your Draw Phase, such as with [[Reload]], only 1 of the cards needs to be a Normal Monster to trigger [[Heart of the Underdog]], since they are all drawn at the same time. If you activate [[Reload]] in your Draw Phase and draw 5 Normal Monster Cards, your [[Heart of the Underdog]] only activates 1 time because it says \"card(s)\"."
    }
]