[
    {
        "cardid": "sXzMV9aqCEG1LE7UcLCSDg==",
        "sequence": 1,
        "ruling": "- For this card's effect, the chosen attack target must still be legal. You cannot force a monster to attack directly if it normally cannot, or force a monster to attack a monster on its own side of the field."
    },
    {
        "cardid": "sXzMV9aqCEG1LE7UcLCSDg==",
        "sequence": 2,
        "ruling": "- The effect of [[Patrician of Darkness]] does not override the effects of [[Marauding Captain]], [[The Legendary Fisherman]], [[Solar Flare Dragon]], etc. You cannot choose an attack target prevented by the effects of these cards. Examples: You cannot choose [[The Legendary Fisherman]] as an attack target if [[Umi]] is on the field. You cannot choose another Warrior-Type monster as an attack target when you control [[Marauding Captain]]."
    },
    {
        "cardid": "sXzMV9aqCEG1LE7UcLCSDg==",
        "sequence": 3,
        "ruling": "- [[Inaba White Rabbit]] must still attack your Life Points directly since it is not able to attack other monsters. You cannot force it to with this card's effect."
    },
    {
        "cardid": "sXzMV9aqCEG1LE7UcLCSDg==",
        "sequence": 4,
        "ruling": "- If a monster has the optional effect of attacking directly, such as [[Rainbow Flower]], you may choose a monster as an attack, or a direct attack."
    },
    {
        "cardid": "sXzMV9aqCEG1LE7UcLCSDg==",
        "sequence": 5,
        "ruling": "- When you control [[Patrician of Darkness]] and a monster equipped with [[Ring of Magnetism]] you must chose the equipped monster as the attack target."
    },
    {
        "cardid": "sXzMV9aqCEG1LE7UcLCSDg==",
        "sequence": 6,
        "ruling": "- Replays may occur as normal when this card is on the field. If, after the replay, [[Patrician of Darkness]] is still on the field and they choose to restart the attack, you will still choose the attack target with the effect of [[Patrician of Darkness]]."
    },
    {
        "cardid": "sXzMV9aqCEG1LE7UcLCSDg==",
        "sequence": 7,
        "ruling": "- If you control [[Patrician of Darkness]] and [[Lord of D.]] you may still choose Dragon-Type monsters on your side of the field as attack targets."
    }
]