[
    {
        "cardid": "Ya0cX37I80eKzWcVAxCghA==",
        "sequence": 1,
        "ruling": "- If your opponent chains [[Enemy Controller]] to the activation of the Flip Effect of a \"Charmer\", and takes control of the \"Charmer\", the Flip Effect disappears."
    },
    {
        "cardid": "Ya0cX37I80eKzWcVAxCghA==",
        "sequence": 2,
        "ruling": "- If you take control of the opponent's monster with a \"Charmer\" and the opponent takes control back with [[Change of Heart]], control still reverts to you after the effect of [[Change of Heart]] expires (even though it wasn't your monster originally)."
    },
    {
        "cardid": "Ya0cX37I80eKzWcVAxCghA==",
        "sequence": 3,
        "ruling": "- If your opponent takes control of your monster with [[Snatch Steal]], and you activate the Flip Effect of a \"Charmer\" to take it back, you keep control while the \"Charmer\" is face-up on the field."
    },
    {
        "cardid": "Ya0cX37I80eKzWcVAxCghA==",
        "sequence": 4,
        "ruling": "- If [[Book of Moon]] is chained to the Flip Effect of a \"Charmer\" to flip the target monster face-down, the effect of the \"Charmer\" disappears."
    },
    {
        "cardid": "Ya0cX37I80eKzWcVAxCghA==",
        "sequence": 5,
        "ruling": "- If a \"Charmer\" is removed from play with [[Interdimensional Matter Transporter]], its effect is not re-applied when it's back on the field."
    },
    {
        "cardid": "Ya0cX37I80eKzWcVAxCghA==",
        "sequence": 6,
        "ruling": "- If [[DNA Transplant]] changes a monster's Attribute so that it can be taken by a \"Charmer\", and then [[DNA Transplant]] is destroyed so that the monster's Attribute no longer corresponds to the effect of the \"Charmer\", the controller of the \"Charmer\" loses control of the monster."
    },
    {
        "cardid": "Ya0cX37I80eKzWcVAxCghA==",
        "sequence": 7,
        "ruling": "- If the turn player controls a \"Charmer\" and a monster controlled by its effect, and activates [[Assault on GHQ]] and targets the controlled monster, and the opponent chains an effect to destroy the \"Charmer\", the controlled monster returns to the opponent's control, but is still destroyed by the effect of [[Assault on GHQ]]."
    }
]