[
    {
        "cardid": "hTNqZf9xSEySgVqr9DRJHA==",
        "sequence": 1,
        "ruling": "- Flipping [[Majestic Mech - Ohka]] or [[Majestic Mech - Goryu]] face-down will not reset their memory of how they were Summoned. So if you Normal Summoned them with fewer Tributes by using their effect, they will still be sent to the Graveyard by their effect during the End Phase even if they have been flipped face-down since being Summoned. (However, as long as they are face-down DURING the End Phase, their effect will not activate during that End Phase.)"
    },
    {
        "cardid": "hTNqZf9xSEySgVqr9DRJHA==",
        "sequence": 2,
        "ruling": "- The effect of [[Majestic Mech - Ohka]] and [[Majestic Mech - Goryu]] that sends itself to the Graveyard will activate during the End Phase of every turn (if they were Normal Summoned with fewer Tributes by using their effect)."
    },
    {
        "cardid": "hTNqZf9xSEySgVqr9DRJHA==",
        "sequence": 3,
        "ruling": "- If [[Skill Drain]] is active during the End Phase, it will negate the effects of a \"Majestic Mech\" so the \"Majestic Mech\" will not send itself to the Graveyard."
    },
    {
        "cardid": "hTNqZf9xSEySgVqr9DRJHA==",
        "sequence": 4,
        "ruling": "- If you activate [[Cost Down]] and Normal Summon [[Majestic Mech - Ohka]] without Tributes (because it is Level 4) or [[Majestic Mech - Goryu]] with 1 Tribute (because it is Level 6), their effects will still activate during the End Phase and they will be sent to the Graveyard."
    },
    {
        "cardid": "hTNqZf9xSEySgVqr9DRJHA==",
        "sequence": 5,
        "ruling": "- If you Tribute [[Kaiser Sea Horse]] to Normal Summon [[Majestic Mech - Goryu]] it is still only 1 monster being Tributed so its effect will activate during the End Phase and it will be sent to the Graveyard."
    },
    {
        "cardid": "hTNqZf9xSEySgVqr9DRJHA==",
        "sequence": 6,
        "ruling": "- The effect of a \"Majestic Mech\" to send itself to the Graveyard is a Trigger Effect that can be chained to."
    }
]