[
    {
        "cardid": "Qk0FZqZ3R06W077B3Zxg9g==",
        "sequence": 1,
        "ruling": "- You declare a monster card name when [[Cloak and Dagger]] resolves."
    },
    {
        "cardid": "Qk0FZqZ3R06W077B3Zxg9g==",
        "sequence": 2,
        "ruling": "- This card's removal effect starts a Chain."
    },
    {
        "cardid": "Qk0FZqZ3R06W077B3Zxg9g==",
        "sequence": 3,
        "ruling": "- You cannot activate this card during the Damage Step."
    },
    {
        "cardid": "Qk0FZqZ3R06W077B3Zxg9g==",
        "sequence": 4,
        "ruling": "- If this card was already activated and face-up when the declared monster is flipped face-up or Summoned during the Damage Step, this card's effect will activate at the same time as a Flip Effect (after Damage Calculation)."
    },
    {
        "cardid": "Qk0FZqZ3R06W077B3Zxg9g==",
        "sequence": 5,
        "ruling": "- This card must be face-up and active on the field before the declared monster is Summoned or flipped face-up. If you Chain this card's activation to the effect of a monster that activates when that monster is Summoned or flipped face-up and declare that monster's name, it will not be removed from play."
    },
    {
        "cardid": "Qk0FZqZ3R06W077B3Zxg9g==",
        "sequence": 6,
        "ruling": "- If [[Cloak and Dagger]] is face-up and active, and the declared monster is Summoned or flipped face-up during resolution of a Chain, it will be removed from play after resolving all effects on that Chain."
    },
    {
        "cardid": "Qk0FZqZ3R06W077B3Zxg9g==",
        "sequence": 7,
        "ruling": "- If multiple copies of the declared monster are Summoned at the same time, they will all be removed from play."
    },
    {
        "cardid": "Qk0FZqZ3R06W077B3Zxg9g==",
        "sequence": 8,
        "ruling": "- If [[Ring of Destruction]], etc. is Chained to the effect of [[Cloak and Dagger]] to destroy the monster that was Summoned or flipped face-up, [[Cloak and Dagger]] will still remove itself from play."
    },
    {
        "cardid": "Qk0FZqZ3R06W077B3Zxg9g==",
        "sequence": 9,
        "ruling": "- If multiple copies of the declared monster are Summoned by effects on different Links of the same Chain, only the first one Summoned (the one Summoned at the highest Chain Link) will be removed from play. For example, if 2 copies of [[Goldd, Wu-Lord of Dark World]] are discarded at the same time, only 1 is removed from play."
    },
    {
        "cardid": "Qk0FZqZ3R06W077B3Zxg9g==",
        "sequence": 10,
        "ruling": "- If your opponent already controls a copy of the declared monster, then Summons another copy, only the newly Summoned monster will be removed from play."
    },
    {
        "cardid": "Qk0FZqZ3R06W077B3Zxg9g==",
        "sequence": 11,
        "ruling": "- If you Special Summon the monster declared by [[Cloak and Dagger]], you can Chain [[Inferno Reckless Summon]] to the effect of [[Cloak and Dagger]]. Only the first monster Summoned (the one that triggered the effect of [[Cloak and Dagger]]) will be removed from play."
    }
]