[
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 1,
        "ruling": "- [[Inferno Reckless Summon]] does not target. Your opponent chooses a monster on his/her side of the field when [[Inferno Reckless Summon]] resolves."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 2,
        "ruling": "- [[Inferno Reckless Summon]] cannot be activated in the Damage Step."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 3,
        "ruling": "- If there are not enough available Monster Zone spaces for each monster that will be Special Summoned, the monsters that cannot be Special Summoned are sent to the Graveyard instead."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 4,
        "ruling": "- [[Inferno Reckless Summon]] cannot be activated when your monster is Special Summoned face-down. Your opponent cannot select a face-down monster when resolving [[Inferno Reckless Summon]]."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 5,
        "ruling": "- Your opponent cannot chose a monster that cannot be Special Summoned."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 6,
        "ruling": "- When resolving [[Inferno Reckless Summon]], first the player that activated [[Inferno Reckless Summon]] Special Summons his/her monsters, and then the opponent Special Summons his/her monsters. The monsters are treated as being Special Summoned at the same time."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 7,
        "ruling": "- [[Inferno Reckless Summon]] cannot be activated when multiple monsters are Special Summoned by the same effect."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 8,
        "ruling": "- [[Inferno Reckless Summon]] cannot be activated when you Special Summon a monster token. Your opponent cannot choose a monster token."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 9,
        "ruling": "- If the monster you Special Summon will have 1500 or less ATK when it is Special Summoned because of a card effect, you can activate [[Inferno Reckless Summon]]."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 10,
        "ruling": "- If an effect is chained that removes your Special Summoned monster from the field or flips it face-down, your opponent will still Special Summon his/her monsters. If an effect is chained that removes your opponent's only face-up monster from play or flips it face-down, your monsters are still Special Summoned. If your Special Summoned monster and your opponent's only face-up monster are flipped face-down or removed from the field, the effect of [[Inferno Reckless Summon]] disappears."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 11,
        "ruling": "- When you Special Summon a Fusion Monster or Ritual Monster with 1500 or less ATK and you have additional copies in your Graveyard that can be Special Summoned from the Graveyard, you can activate [[Inferno Reckless Summon]]."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 12,
        "ruling": "- If you Special Summon a monster that cannot be Special Summoned from the Graveyard, you can activate [[Inferno Reckless Summon]] but copies in the Graveyard are not Special Summoned."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 13,
        "ruling": "- You can activate [[Inferno Reckless Summon]] when the only face-up monster your opponent controls is a monster token or a monster that is Limited. In this case you will Special Summon, but your opponent will not."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 14,
        "ruling": "- If an effect is chained that increases the ATK of your Special Summoned monster above 1500 ATK, your monsters are still Special Summoned."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 15,
        "ruling": "- If you activate [[Inferno Reckless Summon]] when you Special Summon [[Proto-Cyber Dragon]], you will Special Summon [[Cyber Dragon]] from your hand, Deck, and Graveyard."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 16,
        "ruling": "- You can activate [[Inferno Reckless Summon]] when your opponent Special Summons a monster with 1500 or less ATK onto your side of the field."
    },
    {
        "cardid": "6GHlf3rRxEWnzx0fPYSj4w==",
        "sequence": 17,
        "ruling": "- If either player does not Special Summon monsters so that they have 3 monsters with the same name in play after resolving [[Inferno Reckless Summon]], the opponent can check that player's hand and Deck to verify that they have Summoned all possible copies of the chosen monster. If that monster is Limited or Semi-Limited, and the maximum number of copies allowed per Deck are on that player's side of the field the field, in their Graveyard or in their Removed Zone, their opponent can not check their hand and Deck for additional copies."
    }
]