[
    {
        "cardid": "0AXGiSdNsUKklgeLhfRQBA==",
        "sequence": 1,
        "ruling": "- If you have two copies of [[Magical Thorn]] active on the field, your opponent will take 1000 points of damage whenever they discard a card. If you have three copies, they will take 1500 points of damage."
    },
    {
        "cardid": "0AXGiSdNsUKklgeLhfRQBA==",
        "sequence": 2,
        "ruling": "- The effect of [[Magical Thorn]] is applied when the opponent discards during the End Phase to make their hand size 6, discarding for the cost of cards such as [[Tribute to the Doomed]], [[Cost Down]], or [[Judgment of Anubis]], and discarding for card effects such as [[Delinquent Duo]], [[Confiscation]], [[Robbin' Goblin]], [[Morphing Jar]] and [[Mefist the Infernal General]]."
    },
    {
        "cardid": "0AXGiSdNsUKklgeLhfRQBA==",
        "sequence": 3,
        "ruling": "- The effect of [[Magical Thorn]] is NOT applied when you send cards from your hand to the Graveyard for things such as a Tribute for a Ritual Spell Card, a Fusion Material Monster, or the effects of cards like [[Chosen One]] or [[Gravekeeper's Watcher]]."
    },
    {
        "cardid": "0AXGiSdNsUKklgeLhfRQBA==",
        "sequence": 4,
        "ruling": "- The effect of [[Magical Thorn]] is NOT applied when cards in your hand are destroyed by [[Chain Destruction]] or when cards are sent from the Deck to Graveyard by the effect of [[Painful Choice]]. It is also NOT applied when cards in your hand are removed from play by the effect of [[Lightforce Sword]]."
    },
    {
        "cardid": "0AXGiSdNsUKklgeLhfRQBA==",
        "sequence": 5,
        "ruling": "- The effect of [[Magical Thorn]] is only applied when a card is discarded from your opponent's hand to your opponent's Graveyard. So if they have your card in your hand by the effect of [[Exchange]] or [[Graverobber]] and they discard it, they do not take any damage from the effect of [[Magical Thorn]]."
    },
    {
        "cardid": "0AXGiSdNsUKklgeLhfRQBA==",
        "sequence": 6,
        "ruling": "- If the opponent discards from their hand as a cost to activate a card like [[Cost Down]] and you chain [[Magical Thorn]] they will not take any damage. If your opponent activates a card where discarding is part of the effect of the card, such as [[Card Destruction]], and you chain [[Magical Thorn]], they WILL take damage because the effect of [[Magical Thorn]] will be active before the discarding effect resolves."
    },
    {
        "cardid": "0AXGiSdNsUKklgeLhfRQBA==",
        "sequence": 7,
        "ruling": "- [[Magical Thorn]] deals damage per card, so if the opponent activates [[Graceful Charity]] they will take 1000 points of damage when they discard 2 cards. If they discard 5 cards to activate [[Final Destiny]] they take 2500 points of damage."
    },
    {
        "cardid": "0AXGiSdNsUKklgeLhfRQBA==",
        "sequence": 8,
        "ruling": "- Even though [[Magical Thorn]] does damage per card discarded, it deals the damage as one lump sum for effects like [[Dark Room of Nightmare]]."
    },
    {
        "cardid": "0AXGiSdNsUKklgeLhfRQBA==",
        "sequence": 9,
        "ruling": "- [[Necrovalley]] does not negate the effect of [[Magical Thorn]]."
    },
    {
        "cardid": "0AXGiSdNsUKklgeLhfRQBA==",
        "sequence": 10,
        "ruling": "- The effect of [[Magical Thorn]] inflicts damage after an effect resolves. So if the effect of [[Morphing Jar]] is activated, the damage will be dealt after the new cards are drawn. This means if your opponent has 100 Life Points, and you have [[Magical Thorn]] active on the field but only one card left in your Deck, you will lose the Duel before the effect of [[Magical Thorn]] can deal damage to reduce your opponent's Life Points to 0."
    },
    {
        "cardid": "0AXGiSdNsUKklgeLhfRQBA==",
        "sequence": 11,
        "ruling": "- [[Magical Thorn]] will deal damage between steps in a chain. For example, both you and your opponent have 100 Life Points remaining, your opponent has two cards in their hand and you have [[Magical Thorn]] active on the field and a Set [[Mind Crush]]. It is your opponent's turn and they activate [[Final Flame]] to deal 600 points of damage to you, and you chain [[Mind Crush]] calling the [[Sinister Serpent]] you know they have in their hand. After Step 2 ([[Mind Crush]]) resolves, the effect of [[Magical Thorn]] deals 500 points of damage to your opponent and you win the Duel before Step 1, [[Final Flame]], resolves."
    }
]