[
    {
        "cardid": "MKWGlMFoEE+JwXSxirj1dw==",
        "sequence": 1,
        "ruling": "- You place a Spell Counter on this card when the Spell Card resolves, so if [[Magic Jammer]] is used to negate the Spell Card's activation then you do not place a Spell Counter on this monster. But if [[Imperial Order]] is chained to the Spell Card, you still place a Spell Counter on this monster because the activation of the Spell Card was not negated. If the Spell Card was a Continuous, Equip, or Field Spell Card, and [[Dust Tornado]] is chained to its activation and destroys it before it resolves you still place a Spell Counter because the activation of the card was not negated."
    },
    {
        "cardid": "MKWGlMFoEE+JwXSxirj1dw==",
        "sequence": 2,
        "ruling": "- [[Tower of Babel]] must be active and face-up on the field before the Spell Card was activated, and when the Spell Card resolves, in order to get a Spell Counter. If you chain [[Tower of Babel]] to a Spell Card, you do not get a Spell Counter for that Spell Card. If a Quick-Play Spell Card is chained to the activation of [[Tower of Babel]], you do not get a Spell Counter for that Quick-Play Spell Card."
    },
    {
        "cardid": "MKWGlMFoEE+JwXSxirj1dw==",
        "sequence": 3,
        "ruling": "- You can move Spell Counters to [[Tower of Babel]] with [[Pitch-Black Power Stone]], but if the 4th Spell Counter is placed on [[Tower of Babel]] with [[Pitch-Black Power Stone]] or [[Apprentice Magician]], [[Tower of Babel]] is destroyed but no damage is inflicted."
    },
    {
        "cardid": "MKWGlMFoEE+JwXSxirj1dw==",
        "sequence": 4,
        "ruling": "- [[Tower of Babel]] cannot blow up in the middle of a chain. If you wind up with 5 Spell Counters on [[Tower of Babel]] after a chain resolves, the player who caused the 4th Spell Counter to be placed takes the damage. So if you have [[Tower of Babel]] with 3 Spell Counters, and you activate [[Pot of Greed]], and your opponent chains [[Reload]], [[Reload]] resolves first and places the 4th Spell Counter, and your opponent takes the 3000 damage after the current chain resolves."
    },
    {
        "cardid": "MKWGlMFoEE+JwXSxirj1dw==",
        "sequence": 5,
        "ruling": "- If [[Mystical Space Typhoon]] targets [[Tower of Babel]] with 3 Spell Counters, [[Tower of Babel]] is destroyed when [[Mystical Space Typhoon]] resolves, and never gets the 4th Spell Counter, so neither player takes damage."
    }
]