[
    {
        "cardid": "oXzgmHGDJE235+LtowXALA==",
        "sequence": 1,
        "ruling": "- When you activate this card's effect, you must Summon all \"Crystal Beast\" monsters in your Spell & Trap Card Zone that you have open Monster Card Zones for. You cannot choose to Summon fewer than the maximum possible."
    },
    {
        "cardid": "oXzgmHGDJE235+LtowXALA==",
        "sequence": 2,
        "ruling": "- If you have no \"Crystal Beast\" monsters in your Spell & Trap Card Zone when you Special Summon [[Crystal Beast Ruby Carbuncle]], you cannot activate this effect."
    },
    {
        "cardid": "oXzgmHGDJE235+LtowXALA==",
        "sequence": 3,
        "ruling": "- You choose whether or not to use the \"Crystal Beast\" effect at the time the destroyed monster would be sent to the Graveyard."
    },
    {
        "cardid": "oXzgmHGDJE235+LtowXALA==",
        "sequence": 4,
        "ruling": "- This effect does not use the Chain."
    },
    {
        "cardid": "oXzgmHGDJE235+LtowXALA==",
        "sequence": 5,
        "ruling": "- This effect cannot be used if a \"Crystal Beast\" monster is destroyed by a card effect while face-down."
    },
    {
        "cardid": "oXzgmHGDJE235+LtowXALA==",
        "sequence": 6,
        "ruling": "- If multiple \"Crystal Beast\" monsters are destroyed at the same time, and you do not have enough open Spell & Trap Card Zones to place them all in as Continuous Spell Cards, you choose which (if any) to place in your Spell & Trap Card Zone."
    },
    {
        "cardid": "oXzgmHGDJE235+LtowXALA==",
        "sequence": 7,
        "ruling": "- If your opponent controls one of your \"Crystal Beast\" monsters and it is destroyed, your opponent can choose to place it in their Spell & Trap Card Zone. If they choose not to, it is sent to your Graveyard."
    },
    {
        "cardid": "oXzgmHGDJE235+LtowXALA==",
        "sequence": 8,
        "ruling": "- If [[Macro Cosmos]] or [[Banisher of the Light]] is active on the field when a \"Crystal Beast\" monster is destroyed, you can use its effect and still place it in your Spell & Trap Card Zone."
    },
    {
        "cardid": "oXzgmHGDJE235+LtowXALA==",
        "sequence": 9,
        "ruling": "- If a \"Crystal Beast\" battles with a monster such as [[Dark Magician of Chaos]] or [[D.D. Warrior]] it will be removed from play by that monster's effect, you cannot activate your \"Crystal Beast's\" effect."
    },
    {
        "cardid": "oXzgmHGDJE235+LtowXALA==",
        "sequence": 10,
        "ruling": "- If a \"Crystal Beast\" is destroyed by [[Bottomless Trap Hole]] it will be removed from play and you cannot activate its effect."
    },
    {
        "cardid": "oXzgmHGDJE235+LtowXALA==",
        "sequence": 11,
        "ruling": "- While [[Skill Drain]] is active on the field, a \"Crystal Beast\" monster that is destroyed will be sent to the Graveyard and cannot be put in the Spell & Trap Card Zone."
    },
    {
        "cardid": "oXzgmHGDJE235+LtowXALA==",
        "sequence": 12,
        "ruling": "- If you control a \"Crystal Beast\" equipped with [[Premature Burial]] and have no open Spell & Trap Card Zones, when that \"Crystal Beast\" is destroyed [[Premature Burial]] is also destroyed and then you can choose to put that \"Crystal Beast\" into the now empty Zone."
    }
]