[
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 1,
        "ruling": "- You can activate [[Last Will]] before or after a monster is sent to the Graveyard, and still get the effect of [[Last Will]] to Special Summon a monster."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 2,
        "ruling": "- You can choose the timing for when you Special Summon for the effect of [[Last Will]]. You can Special Summon the monster at any time during your turn, except during damage calculation. You do not have to Special Summon the monster at the point the first monster was sent to the Graveyard. If you activated [[Last Will]] after a monster was sent to the Graveyard, you do not have to Special Summon the monster when [[Last Will]] resolves."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 3,
        "ruling": "- If you wish, you may Special Summon the monster immediately after [[Last Will]] resolves (if activated after a monster was destroyed), or when the first monster is sent to the Graveyard (if [[Last Will]] was activated before the monster was destroyed). But you don't have to, you can do it later."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 4,
        "ruling": "- For example, if your monster is destroyed by battle, and you activate [[Last Will]] during Main Phase 2, you can Special Summon a monster at that time. Or you can wait and Special Summon during the End Phase."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 5,
        "ruling": "- You can apply the effect of [[Last Will]] as long as a monster on your side of the field is (or was) sent to your Graveyard, no matter which Phase it was in. As long as it's the same turn in which you activated [[Last Will]]."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 6,
        "ruling": "- If you activate 2 [[Last Will]]s, then you get to Special Summon 2 monsters, as long as a monster is (or was) sent from your side of the field to your Graveyard that same turn."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 7,
        "ruling": "- You only Special Summon 1 monster for each 1 [[Last Will]]."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 8,
        "ruling": "- If you Special Summon using [[Last Will]]'s effect, then you don't get to Special Summon for it again (but you do for any other copies of [[Last Will]] that are activated). If you activate [[Last Will]], and the end of the turn arrives without using [[Last Will]]'s effect, then the effect is gone."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 9,
        "ruling": "- You can Special Summon for [[Last Will]] if a monster was Tributed for a Tribute Summon, or for [[Cannon Soldier]]'s effect, etc."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 10,
        "ruling": "- You can use [[Last Will]]'s effect to Special Summon a Level 5 or higher monster like [[Labyrinth Wall]]."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 11,
        "ruling": "- You cannot Special Summon a \"Special Summon-only\" monster."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 12,
        "ruling": "- [[Last Will]]'s effect can only be used if your OWN monster is (or was) sent from YOUR side of the field to YOUR Graveyard."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 13,
        "ruling": "- If your monster is sent to your Graveyard by battle, you resolve [[Last Will]]'s effect during that same Battle Phase (but not during the Damage Step). If it's your turn, then your newly Summoned monster can attack before Main Phase 2."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 14,
        "ruling": "- If [[Imperial Order]] is activated after [[Last Will]] has resolved, it will not negate [[Last Will]]'s effect."
    },
    {
        "cardid": "1YjsoSPzkUqzs75acnsykw==",
        "sequence": 15,
        "ruling": "- You can Special Summon a 1500 ATK monster that will have higher than 1500 ATK after being Summoned, such as a Fiend with 1500 original ATK while [[Yami]] is on the field (its ATK once Summoned will be 1700). You can Special Summon [[Muka Muka]] even if you have 6 cards in your hand and [[Muka Muka]]'s ATK, once Summoned, will be higher than 1500."
    }
]