[
    {
        "cardid": "adYlqwUIlECXSkEX5rOD0g==",
        "sequence": 1,
        "ruling": "- You can activate [[Divine Wrath]] when [[Sacred Phoenix of Nephthys]] is Special Summoned by its own effect. Because this effect activates in the Graveyard, and is being negated while [[Sacred Phoenix of Nephthys]] is in the Graveyard, [[Sacred Phoenix of Nephthys]] is never Special Summoned (so the card is never moved from the Graveyard) and is never destroyed. Because it is not destroyed, its effect to Special Summon itself does not activate again."
    },
    {
        "cardid": "adYlqwUIlECXSkEX5rOD0g==",
        "sequence": 2,
        "ruling": "- If [[Sacred Phoenix of Nephthys]] is Special Summoned with [[Call of the Haunted]] or [[Premature Burial]], and that card is destroyed and destroys [[Sacred Phoenix of Nephthys]] with its effect, you Special Summon [[Sacred Phoenix of Nephthys]] during your next Standby Phase because it was destroyed by a card effect."
    },
    {
        "cardid": "adYlqwUIlECXSkEX5rOD0g==",
        "sequence": 3,
        "ruling": "- If [[Sacred Phoenix of Nephthys]] is destroyed while in your hand or Deck by a card effect, you still activate its effect during your next Standby Phase to Special Summon it from the Graveyard. (For example, if an effect like [[Star Boy]] is active, and [[Sacred Phoenix of Nephthys]] is Summoned, and [[Chain Destruction]] is activated to destroy other copies of [[Sacred Phoenix of Nephthys]] in the hand and Deck, those copies will be Special Summoned during your next Standby Phase."
    },
    {
        "cardid": "adYlqwUIlECXSkEX5rOD0g==",
        "sequence": 4,
        "ruling": "- If [[Skill Drain]] is active on the field, the effect of [[Sacred Phoenix of Nephthys]] that Special Summons it from the Graveyard is still activated, because it is activated in the Graveyard. However, the effect that destroys Spell and Trap Cards on the field is negated because it activates on the field (so [[Skill Drain]] and other Spell and Trap Cards on the field are not destroyed in this case)."
    },
    {
        "cardid": "adYlqwUIlECXSkEX5rOD0g==",
        "sequence": 5,
        "ruling": "- If [[Sacred Phoenix of Nephthys]] is Summoned (except by its effect), and the Summon is negated by [[Horn of Heaven]], it is Special Summoned during your next Standby Phase because it was destroyed by a card effect. When it is Special Summoned by its own effect, [[Horn of Heaven]] or [[Solemn Judgment]] cannot be activated, because it is being Summoned by its own Trigger Effect, not by a built-in this is how you Summon this monster effect."
    },
    {
        "cardid": "adYlqwUIlECXSkEX5rOD0g==",
        "sequence": 6,
        "ruling": "- If your opponent controls your [[Sacred Phoenix of Nephthys]], and it is destroyed by a card effect, because the effect activates in the Graveyard, it is the owner that gets the effect and Special Summons [[Sacred Phoenix of Nephthys]] during their Standby Phase."
    },
    {
        "cardid": "adYlqwUIlECXSkEX5rOD0g==",
        "sequence": 7,
        "ruling": "- If [[Sacred Phoenix of Nephthys]] is destroyed during your Draw Phase, you can Special Summon it during the Standby Phase of that same turn."
    },
    {
        "cardid": "adYlqwUIlECXSkEX5rOD0g==",
        "sequence": 8,
        "ruling": "- If [[Sacred Phoenix of Nephthys]] is destroyed and removed from play, such as with [[Bottomless Trap Hole]], it is not Special Summoned from out of play during the Standby Phase, because this effect activates in the Graveyard."
    },
    {
        "cardid": "adYlqwUIlECXSkEX5rOD0g==",
        "sequence": 9,
        "ruling": "- If [[Rivalry of Warlords]] is active, and your opponent takes control of your [[Sacred Phoenix of Nephthys]] while controlling monsters that are not Winged Beast-Type, [[Sacred Phoenix of Nephthys]] is not considered destroyed by the effect of [[Rivalry of Warlords]], but rather by a condition that made it impossible for it to exist on that side of the field. So it is not Special Summoned by its own effect during the Standby Phase."
    },
    {
        "cardid": "adYlqwUIlECXSkEX5rOD0g==",
        "sequence": 10,
        "ruling": "- If [[Sacred Phoenix of Nephthys]] is destroyed while it is not a Monster Card, such as when it is equipped to [[Relinquished]] or [[Sword Hunter]], its effect does not activate and it is not Special Summoned"
    },
    {
        "cardid": "adYlqwUIlECXSkEX5rOD0g==",
        "sequence": 11,
        "ruling": "- You can chain to the effect of [[Sacred Phoenix of Nephthys]] that destroys all Spell and Trap Cards."
    },
    {
        "cardid": "adYlqwUIlECXSkEX5rOD0g==",
        "sequence": 12,
        "ruling": "- If [[Sacred Phoenix of Nephthys]] is Special Summoned by its effect during the Standby Phase, and [[Card of Safe Return]] is on the field, [[Sacred Phoenix of Nephthys]] is Step 1 of the chain and [[Card of Safe Return]] is Step 2, so [[Card of Safe Return]] resolves first and you draw a card before [[Card of Safe Return]] is destroyed."
    }
]