[
    {
        "cardid": "S23IvxBouUKioTURlhcMHg==",
        "sequence": 1,
        "ruling": "- If [[Winged Kuriboh]] is destroyed as a result of battle, its effect will not reduce the Battle Damage its owner takes from that battle, because its effect doesn't activate until later, when it's sent to the Graveyard. (And damage calculation has already happened by then.)"
    },
    {
        "cardid": "S23IvxBouUKioTURlhcMHg==",
        "sequence": 2,
        "ruling": "- If [[Winged Kuriboh]] is destroyed and sent to the Graveyard, its effect activates and applies for the rest of the turn, even if [[Winged Kuriboh]] is removed from play with [[Disappear]], or shuffled back into the Deck with [[Fiber Jar]]."
    },
    {
        "cardid": "S23IvxBouUKioTURlhcMHg==",
        "sequence": 3,
        "ruling": "- Because the effect of [[Winged Kuriboh]] activates in the Graveyard, it will not be negated by [[Skill Drain]] but it will be negated by [[The End of Anubis]]."
    },
    {
        "cardid": "S23IvxBouUKioTURlhcMHg==",
        "sequence": 4,
        "ruling": "- Because the effect of [[Winged Kuriboh]] activates in the Graveyard, it is the original owner that will get the effect. So if the opponent took control with [[Change of Heart]] or [[Snatch Steal]], if it is destroyed then it goes to the original owner's Graveyard and they get the effect."
    },
    {
        "cardid": "S23IvxBouUKioTURlhcMHg==",
        "sequence": 5,
        "ruling": "- When [[Winged Kuriboh]] is destroyed and sent to the Graveyard, the activation of its effect can be chained to."
    },
    {
        "cardid": "S23IvxBouUKioTURlhcMHg==",
        "sequence": 6,
        "ruling": "- After the effect of [[Winged Kuriboh]] resolves, the application of the effect (making Battle Damage zero) does not start a chain and cannot be chained to."
    },
    {
        "cardid": "S23IvxBouUKioTURlhcMHg==",
        "sequence": 7,
        "ruling": "- If [[Winged Kuriboh]] is treated as an Equip Card (like if it's equipped to [[Relinquished]]) and it's destroyed and sent to the Graveyard, its effect still activates."
    },
    {
        "cardid": "S23IvxBouUKioTURlhcMHg==",
        "sequence": 8,
        "ruling": "- If your opponent takes control of your [[Winged Kuriboh]] and when it tries to return to your control you have no open Monster Card Zones, [[Winged Kuriboh]] is destroyed and sent to the Graveyard, and its effect activates."
    }
]