[
    {
        "cardid": "oETRzcDUrEmuSsQ5UB93TQ==",
        "sequence": 1,
        "ruling": "- This effect does not target."
    },
    {
        "cardid": "oETRzcDUrEmuSsQ5UB93TQ==",
        "sequence": 2,
        "ruling": "- This card can be chained to any type of Spell Card (Normal, Continuous, Quick-Play or Equip or Field.)."
    },
    {
        "cardid": "oETRzcDUrEmuSsQ5UB93TQ==",
        "sequence": 3,
        "ruling": "- This card's effect to return the Spell Card to its owner's hand does not start a Chain."
    },
    {
        "cardid": "oETRzcDUrEmuSsQ5UB93TQ==",
        "sequence": 4,
        "ruling": "- This card's effect is only applied once, the first time the Spell Card it was chained to is sent from the field to the Graveyard for any reason. This includes an Equip Spell Card equipped to a monster Tributed for a Tribute Summon, or a card sent to the Graveyard as a cost for [[Emergency Provisions]], etc."
    },
    {
        "cardid": "oETRzcDUrEmuSsQ5UB93TQ==",
        "sequence": 5,
        "ruling": "- The Spell Card must be sent to the Graveyard, if it is removed from play, it will not return to your hand."
    },
    {
        "cardid": "oETRzcDUrEmuSsQ5UB93TQ==",
        "sequence": 6,
        "ruling": "- If the Spell Card that [[Spell Reclamation]] was chained to is removed from play, or returned to the hand, etc. instead of going to the Graveyard, [[Spell Reclamation]]'s effect is no longer applied."
    },
    {
        "cardid": "oETRzcDUrEmuSsQ5UB93TQ==",
        "sequence": 7,
        "ruling": "- If the Spell Card that [[Spell Reclamation]] affected is sent to the Graveyard during resolution of a Chain, it returns to the owner's hand immediately after resolving the effect that sent it to the Graveyard."
    },
    {
        "cardid": "oETRzcDUrEmuSsQ5UB93TQ==",
        "sequence": 8,
        "ruling": "- This card can only be chained to the activation a Spell Card, and not when the effect of a Spell Card is activated (by [[Destiny Hero - Diamond Dude]], etc.)"
    },
    {
        "cardid": "oETRzcDUrEmuSsQ5UB93TQ==",
        "sequence": 9,
        "ruling": "- If [[Spell Reclamation]] is chained to a Spell Card's activation, and [[Mystical Space Typhoon]], etc. is chained to [[Spell Reclamation]] targeting the same Spell Card, that Spell Card will not return to its owner's hand because it is destroyed before [[Spell Reclamation]] resolves."
    },
    {
        "cardid": "oETRzcDUrEmuSsQ5UB93TQ==",
        "sequence": 10,
        "ruling": "- If a Spell Card that has an effect that activates when it is sent to the Graveyard, like [[Black Pendant]] or [[Lucky Iron Axe]], is affected by [[Spell Reclamation]], that Spell Card's effect will activate, and it will be returned to its owner's hand before resolving the effect."
    }
]