[
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 1,
        "ruling": "- When [[Rivalry of Warlords]] is activated, each player must send monsters to the Graveyard so that he controls only 1 Type of monster face-up. You don't select or name a Type when [[Rivalry of Warlords]] is activated; instead, you make it so you have only 1 Type. If, after this, your monsters are destroyed so you have no monsters on the field, you are free to play any Type again, and that new Type becomes the Type that you must play. (So if you send monsters to the Graveyard so you control only Spellcaster-Typess, and your Spellcaster-Type monsters are destroyed, you may play a Dragon-Type monster, but can then only play Dragon-Type monsters as long as you control 1 or more face-up Dragon-Type monsters. If all your monsters are again destroyed, you can again play whatever Type you want.)"
    },
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 2,
        "ruling": "- This also means that when [[Rivalry of Warlords]] is active, each player can control a different face-up Type than his opponent."
    },
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 3,
        "ruling": "- You can activate [[Rivalry of Warlords]] when either or both player(s) does not have any face-up monsters on the field, in which case once a player does have a face-up monster that monster's Type becomes that player's Type for purposes of [[Rivalry of Warlords]] (as long as the monster remains face-up on that player's side of the field)."
    },
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 4,
        "ruling": "- When [[Rivalry of Warlords]] is activated, it has no effect on monsters that are face-down at that time and does not flip those monsters face-up."
    },
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 5,
        "ruling": "- While [[Rivalry of Warlords]] is active, you can still Set monsters face-down if they are a different Type than the Type you control. If your face-down monster of a different Type is attacked, then the monster is destroyed after damage calculation. If the destroyed monster of a different Type was a Flip Effect Monster, its Flip Effect is still activated, and then the destroyed monster is sent to the Graveyard. If your face-down monster of a different Type is flipped by [[Swords of Revealing Light]], [[Book of Taiyou]], etc., then it is destroyed as necessary."
    },
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 6,
        "ruling": "- As long as [[Rivalry of Warlords]] is active, you cannot Summon, Flip Summon, or Special Summon an inappropriate Type face-up (including [[Jinzo]]), but you can Special Summon face-down with [[The Shallow Grave]], [[Morphing Jar #2]], etc."
    },
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 7,
        "ruling": "- If you have only 1 monster on the field face-up, you may Tribute it for a monster that is a different Type."
    },
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 8,
        "ruling": "- If you have 2 monsters on the field face-up of the same Type, you cannot Tribute 1 of them for another monster that is a different Type (even [[Jinzo]]) as you would then have 2 different Types."
    },
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 9,
        "ruling": "- If [[Cyber Jar]] is activated while [[Rivalry of Warlords]] is active, you can Special Summon different Types of monsters face-down without penalty, or Special Summon 1 Type face-up and all the others face-down. But if you Special Summon different Types of monsters face-up, you have to destroy monsters to make it 1 Type."
    },
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 10,
        "ruling": "- When [[Rivalry of Warlords]] is active, and you change the Type of all of your monsters with [[DNA Surgery]] or [[Parasite Paracide]] or [[D. Tribe]], you now only have 1 Type so you are OK and no monsters are destroyed, and you can also Summon, Flip Summon, and Special Summon additional monsters that do not have that printed Type on the card and they will be considered that Type and are not destroyed."
    },
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 11,
        "ruling": "- If you activate [[Magical Hats]] while [[Rivalry of Warlords]] is active, the cards Special Summoned with [[Magical Hats]] are unaffected by [[Rivalry of Warlords]] because they have no Type."
    },
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 12,
        "ruling": "- When [[Rivalry of Warlords]] is active you can activate [[Dragonic Attack]], but if you have other face-up monsters that are not Dragon-Types then the targeted monster is destroyed."
    },
    {
        "cardid": "/7HmzQRH9EmMdeb77CUJTg==",
        "sequence": 13,
        "ruling": "- If [[Rivalry of Warlords]] is active and you take control of your opponent's face-up monster with [[Change of Heart]] or [[Snatch Steal]], and that monster is a different Type than your other face-up monster(s), your opponent's monster is destroyed."
    }
]