[
    {
        "cardid": "P5M045auVEelre+HBSuEOg==",
        "sequence": 1,
        "ruling": "- When you activate [[Lyla, Lightsworn Sorceress]]' effect to destroy 1 Spell or Trap Card, it is changed to Defense Position when the effect resolves. It is not a cost to activate this effect."
    },
    {
        "cardid": "P5M045auVEelre+HBSuEOg==",
        "sequence": 2,
        "ruling": "- This effect targets 1 Spell or Trap Card your opponent controls."
    },
    {
        "cardid": "P5M045auVEelre+HBSuEOg==",
        "sequence": 3,
        "ruling": "- If you activate [[Lyla, Lightsworn Sorceress]]' effect while [[Final Attack Orders]] is active, [[Lyla, Lightsworn Sorceress]] will be changed to Attack Position after resolving its effect and its effect can be activated again."
    },
    {
        "cardid": "P5M045auVEelre+HBSuEOg==",
        "sequence": 4,
        "ruling": "- If you activate [[Lyla, Lightsworn Sorceress]]' effect and an effect is chained that shifts [[Lyla, Lightsworn Sorceress]] into Defense Position or removes it from the field, its effect disappears."
    },
    {
        "cardid": "P5M045auVEelre+HBSuEOg==",
        "sequence": 5,
        "ruling": "- If you do not have enough cards to send to the Graveyard remaining in your Deck when resolving the effect of a \"Lightsworn\" monster or [[Judgment Dragon]], all cards remaining in your Deck are sent to the Graveyard. For example, if you control [[Jain, Lightsworn Paladin]] and its effect activates during your End Phase when you have only 1 card remaining in your Deck, that card will be sent to the Graveyard."
    },
    {
        "cardid": "P5M045auVEelre+HBSuEOg==",
        "sequence": 6,
        "ruling": "- If the effect of a \"Lightsworn\" monster to send cards from the top of your Deck to your Graveyard during the End Phase is negated by the effect of [[Light and Darkness Dragon]], that \"Lightsworn\" monster's effect activates again in the same End Phase."
    },
    {
        "cardid": "P5M045auVEelre+HBSuEOg==",
        "sequence": 7,
        "ruling": "- If an effect chained to a \"Lightsworn\" monster's (or [[Judgment Dragon]]'s) effect to send cards from your Deck to the Graveyard during the End Phase that removes that \"Lightsworn\" monster from the field, the \"Lightsworn\" monster's effect does not resolve."
    }
]