[
    {
        "cardid": "gwDf6NvidECypJwrn4h/Rw==",
        "sequence": 1,
        "ruling": "- You can only activate this card's effect once per turn. Even if [[Anteatereatingant]] can attack multiple times because it's equipped with [[Twin Swords of Flashing Light - Tryce]], it can only give up its potential to attack once."
    },
    {
        "cardid": "gwDf6NvidECypJwrn4h/Rw==",
        "sequence": 2,
        "ruling": "- The effect of [[Anteatereatingant]] targets 1 Spell or Trap Card."
    },
    {
        "cardid": "gwDf6NvidECypJwrn4h/Rw==",
        "sequence": 3,
        "ruling": "- You can send a Field Spell Card to the Graveyard as part of the cost to Special Summon [[Anteatereatingant]]. You can also use a Monster Card treated as an Equip Card, such as a Union Monster or a monster equipped to [[Relinquished]]."
    },
    {
        "cardid": "gwDf6NvidECypJwrn4h/Rw==",
        "sequence": 4,
        "ruling": "- If you attack with [[Anteatereatingant]] and the attack is negated with [[Negate Attack]], or a replay happens and you decide not to attack again, [[Anteatereatingant]] is still considered to have declared an attack. So you cannot activate its effect during Main Phase 2."
    },
    {
        "cardid": "gwDf6NvidECypJwrn4h/Rw==",
        "sequence": 5,
        "ruling": "- If you activate the effect of [[Anteatereatingant]], then activate [[Skill Drain]], [[Anteatereatingant]] still can't attack that turn. (Even if [[Skill Drain]] was chained to the effect.)"
    },
    {
        "cardid": "gwDf6NvidECypJwrn4h/Rw==",
        "sequence": 6,
        "ruling": "- You CAN activate the effect of [[Anteatereatingant]], flip it face-down with a card effect, then Flip Summon it, and either activate its effect again or attack. This is because flipping it face-down resets its effect. (Also, if it's temporarily removed from play, its effect will also reset.)"
    },
    {
        "cardid": "gwDf6NvidECypJwrn4h/Rw==",
        "sequence": 7,
        "ruling": "- If the targeted Spell or Trap Card is removed from the field in a chain to this card's effect, you still cannot use its effect again or attack that turn. If a targeted Spell Card is not destroyed because of a counter from [[Magic Reflector]], you still cannot use this card's effect again or attack that turn."
    }
]