[
    {
        "cardid": "DA4q6tKu102khm2/SICAuw==",
        "sequence": 1,
        "ruling": "- This effect does not activate when your \"Destiny Hero\" monster is destroyed. This effect activates during your Standby Phase, so [[Destiny Hero - Captain Tenacious]] must be face-up on your side of the field at that time to Special Summon the \"Destiny Hero\" monster."
    },
    {
        "cardid": "DA4q6tKu102khm2/SICAuw==",
        "sequence": 2,
        "ruling": "- [[Destiny Hero - Captain Tenacious]] must be on your side of the field when the other \"Destiny Hero\" monster you control is destroyed by battle, and must remain on your side of the field until your following Standby Phase. If it is removed from the field or Special Summoned after the other \"Destiny Hero\" monster you control is destroyed by battle, you cannot activate its effect in your following Standby Phase."
    },
    {
        "cardid": "DA4q6tKu102khm2/SICAuw==",
        "sequence": 3,
        "ruling": "- This effect is a Trigger Effect that can be chained to."
    },
    {
        "cardid": "DA4q6tKu102khm2/SICAuw==",
        "sequence": 4,
        "ruling": "- If [[Skill Drain]] is active during the Standby Phase when this effect resolves, this effect will be negated, even if [[Skill Drain]] was activated after your \"Destiny Hero\" monster was destroyed."
    },
    {
        "cardid": "DA4q6tKu102khm2/SICAuw==",
        "sequence": 5,
        "ruling": "- [[Divine Wrath]] can be chained to [[Destiny Hero - Captain Tenacious]]'s effect when it activates during your Standby Phase."
    },
    {
        "cardid": "DA4q6tKu102khm2/SICAuw==",
        "sequence": 6,
        "ruling": "- Each [[Destiny Hero - Captain Tenacious]] can Special Summon 1 monster during your Standby Phase, so if you have 2 [[Destiny Hero - Captain Tenacious]]es face-up on the field and 2 \"Destiny Hero\" monsters in your Graveyard that were destroyed as a result of battle since your last Standby Phase, you can activate and resolve their effects one at a time."
    }
]