[
    {
        "cardid": "eg0h+Kv/FU2SF+oMIWNrBA==",
        "sequence": 1,
        "ruling": "- For the effect of [[Fatal Abacus]] to trigger, a Monster Card that is being treated as a monster must be sent from the field to the Graveyard. This means that a Monster Card equipped to [[Relinquished]] or [[Sword Hunter]] that is sent to the Graveyard will not trigger this effect. Also, a Spell or Trap Card that is destroyed while being treated as a monster by the effect of [[Magical Hats]] will not trigger this effect."
    },
    {
        "cardid": "eg0h+Kv/FU2SF+oMIWNrBA==",
        "sequence": 2,
        "ruling": "- Monster Tokens do not trigger this card's effect because they are not sent to the Graveyard."
    },
    {
        "cardid": "eg0h+Kv/FU2SF+oMIWNrBA==",
        "sequence": 3,
        "ruling": "- Monsters that are removed from play and monsters that are destroyed while [[Banisher of the Light]] is on the field do not trigger this card's effect.  This is because they never go to the Graveyard."
    },
    {
        "cardid": "eg0h+Kv/FU2SF+oMIWNrBA==",
        "sequence": 4,
        "ruling": "- \"Sent from the field to the Graveyard\" includes cards that are destroyed, Tributed, or sent straight from the field to the Graveyard."
    },
    {
        "cardid": "eg0h+Kv/FU2SF+oMIWNrBA==",
        "sequence": 5,
        "ruling": "- If multiple [[Fatal Abacus]] cards are active on the field, a player will take 500 points of damage for each when one of their monsters is sent from the field to the Graveyard. So if 2 are active, a player will take 1000 points of damage and if 4 are on the field (you have 3 active and your opponent has 1 active) a player will take 2000 points of damage."
    },
    {
        "cardid": "eg0h+Kv/FU2SF+oMIWNrBA==",
        "sequence": 6,
        "ruling": "- It is the owner of the Monster Card that takes the damage, so if you control your opponent's monster through the effect of [[Change of Heart]] and Tribute it, your opponent takes the 500 points of damage."
    }
]